ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F1xx/stm32f100xe.h
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE)           0U

/****************************** END TIM Instances *****************************/


/******************** USART Instances : Synchronous mode **********************/                                           
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                     ((INSTANCE) == USART2) || \
                                     ((INSTANCE) == USART3))

/******************** UART Instances : Asynchronous mode **********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART3) || \
                                    ((INSTANCE) == UART4)  || \
                                    ((INSTANCE) == UART5))

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                               ((INSTANCE) == USART2) || \
                                               ((INSTANCE) == USART3) || \
                                               ((INSTANCE) == UART4)  || \
                                               ((INSTANCE) == UART5))

/******************** UART Instances : LIN mode **********************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                        ((INSTANCE) == USART2) || \
                                        ((INSTANCE) == USART3) || \
                                        ((INSTANCE) == UART4)  || \
                                        ((INSTANCE) == UART5))

/****************** UART Instances : Hardware Flow control ********************/                                    
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == USART3))

/********************* UART Instances : Smard card mode ***********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                         ((INSTANCE) == USART2) || \
                                         ((INSTANCE) == USART3))

/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART3) || \
                                    ((INSTANCE) == UART4)  || \
                                    ((INSTANCE) == UART5))

/***************** UART Instances : Multi-Processor mode **********************/
#define IS_UART_MULTIPROCESSOR_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                   ((INSTANCE) == USART2) || \
                                                   ((INSTANCE) == USART3) || \
                                                   ((INSTANCE) == UART4)  || \
                                                   ((INSTANCE) == UART5))

/***************** UART Instances : DMA mode available **********************/
#define IS_UART_DMA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                        ((INSTANCE) == USART2) || \
                                        ((INSTANCE) == USART3) || \
                                        ((INSTANCE) == UART4)  || \
                                        ((INSTANCE) == UART5))

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RTC)

/**************************** WWDG Instances *****************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)




#define RCC_HSE_MIN         4000000U
#define RCC_HSE_MAX        26000000U

#define RCC_MAX_FREQUENCY  24000000U

/**
  * @}
  */ 
/******************************************************************************/
/*  For a painless codes migration between the STM32F1xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */ 
/*  product lines within the same STM32F1 Family                              */
/******************************************************************************/

/* Aliases for __IRQn */
#define ADC1_2_IRQn             ADC1_IRQn
#define OTG_FS_WKUP_IRQn        CEC_IRQn
#define USBWakeUp_IRQn          CEC_IRQn
#define TIM8_BRK_TIM12_IRQn     TIM12_IRQn
#define TIM8_BRK_IRQn           TIM12_IRQn
#define TIM8_UP_IRQn            TIM13_IRQn
#define TIM8_UP_TIM13_IRQn      TIM13_IRQn
#define TIM8_TRG_COM_IRQn       TIM14_IRQn
#define TIM8_TRG_COM_TIM14_IRQn TIM14_IRQn
#define TIM9_IRQn               TIM1_BRK_TIM15_IRQn
#define TIM1_BRK_IRQn           TIM1_BRK_TIM15_IRQn
#define TIM1_BRK_TIM9_IRQn      TIM1_BRK_TIM15_IRQn
#define TIM11_IRQn              TIM1_TRG_COM_TIM17_IRQn
#define TIM1_TRG_COM_IRQn       TIM1_TRG_COM_TIM17_IRQn
#define TIM1_TRG_COM_TIM11_IRQn TIM1_TRG_COM_TIM17_IRQn
#define TIM1_UP_IRQn            TIM1_UP_TIM16_IRQn
#define TIM1_UP_TIM10_IRQn      TIM1_UP_TIM16_IRQn
#define TIM10_IRQn              TIM1_UP_TIM16_IRQn
#define TIM6_IRQn               TIM6_DAC_IRQn


/* Aliases for __IRQHandler */
#define ADC1_2_IRQHandler             ADC1_IRQHandler
#define OTG_FS_WKUP_IRQHandler        CEC_IRQHandler
#define USBWakeUp_IRQHandler          CEC_IRQHandler
#define TIM8_BRK_TIM12_IRQHandler     TIM12_IRQHandler
#define TIM8_BRK_IRQHandler           TIM12_IRQHandler
#define TIM8_UP_IRQHandler            TIM13_IRQHandler
#define TIM8_UP_TIM13_IRQHandler      TIM13_IRQHandler
#define TIM8_TRG_COM_IRQHandler       TIM14_IRQHandler
#define TIM8_TRG_COM_TIM14_IRQHandler TIM14_IRQHandler
#define TIM9_IRQHandler               TIM1_BRK_TIM15_IRQHandler
#define TIM1_BRK_IRQHandler           TIM1_BRK_TIM15_IRQHandler
#define TIM1_BRK_TIM9_IRQHandler      TIM1_BRK_TIM15_IRQHandler
#define TIM11_IRQHandler              TIM1_TRG_COM_TIM17_IRQHandler
#define TIM1_TRG_COM_IRQHandler       TIM1_TRG_COM_TIM17_IRQHandler
#define TIM1_TRG_COM_TIM11_IRQHandler TIM1_TRG_COM_TIM17_IRQHandler
#define TIM1_UP_IRQHandler            TIM1_UP_TIM16_IRQHandler
#define TIM1_UP_TIM10_IRQHandler      TIM1_UP_TIM16_IRQHandler
#define TIM10_IRQHandler              TIM1_UP_TIM16_IRQHandler
#define TIM6_IRQHandler               TIM6_DAC_IRQHandler


/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
  }
#endif /* __cplusplus */
  
#endif /* __STM32F100xE_H */
  
  
  
  /************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
